/**
 * @file
 * @author: lzb
 * @params: 参数说明
 * @history:
 * Date      Version Remarks
 * ========= ======= ==================================
 * 2018/7/3      1.0     First version
 *
 */
/*
* 各位书友大家好，欢迎继续做客我们的读书圈，今天我们来讲投资，在很多文章里老齐都说美股在2018年初的时候已经明显高估了， 而且有了明显的做头迹象，其中一个主要的依据就是席勒市盈率，这个市盈率是由诺贝尔经济学奖得主，耶鲁大学经济学教授，罗伯特席勒发明的，他把市盈率进行了周期性调整，得到了一个更有效率，更加真实的市盈率指标用来反映市场的状况，而2018年年初的时候，美国股市的席勒市盈率已经达到了32倍，超过了1933年，和2007年，仅次于2000年的互联网泡沫，成为了历史次高水平。


那么今天，我们就找来了罗伯特席勒教授的一本经典著作叫做非理性繁荣，来解释一下股市的泡沫。这本书在历史上的地位极高，如果你想更清楚的了解股市泡沫，从而发现这种泡沫，能够率先采取行动，远离泡沫。那就必须要读懂这本非理性繁荣。

非理性繁荣这个词，来自于1996年12月5日，在华盛顿，美联储主席格林斯潘的一次沉闷的讲话，在其中他使用了非理性繁荣这个词，他说出这个词之后，全球股市就狂跌，日经和香港跌了3%，德国和英国跌了4%，美国道琼斯也一开盘就下挫2.3%。一下子非理性繁荣就变成了经典语录。之所以股市会有如此大的表现，是因为大家都猜测，格林斯潘这么说，那是要加息的前奏。

而作者席勒教授看来，正是因为当时股市到了高位，所以才触动了大家敏感的神经，这个词成为了扒掉皇帝的新衣的那句话，特别是在2000年，道琼斯指数6年翻了2倍多，但经济指标并没有同步增长，美国居民收入大概增长不到30%，企业增长不到60%，所以这时候可以看出，股市的这种繁荣并没有什么道理。除了美国之外，1999年，全球股市都在猛涨，法德意西英基本也是6年翻倍，但那段时间，房价并不涨，美国主要十大城市，的住宅价格平均增长率只有9%，这在中国人的脑海里是不可想象的，这也太幸福了，股市暴涨而房价不涨。但席勒教授却深深为此感到担忧。他说2000年前的美股处在一个惊人的高位，这是一个投机性的泡沫。大家注意，席勒教授写这本书的时候，互联网泡沫还没有爆发，所以他当时具有极大的预见性。



他给出了一张图，在图上我们可以看到，股价在1980年以后开始飙涨，但公司的盈利收益情况，有提高，但涨幅远远落后于股价涨幅。所以他针对这一情况，只做了席勒市盈率，也就是扣除了通胀因素，标普指数除以十年平均实际收益指数，所得到的比值，就是席勒市盈率。所以席勒市盈率上涨，说明了股价涨幅远远超过了收益的增长速度。这种情况1901年出现过，1929年第二次出现，之后都爆发了不可磨灭的经济危机，当然后面还有1936年，二战爆发，1967年肯尼迪约翰逊高峰，随后是15年的大熊市，当然还有席勒教授写这本书的时候，2000年互联网泡沫，理论上2008年其实股市的估值还可以。

那么市盈率和投资收益有关系吗？当然有关系，在过去的100多年历史中，市盈率越低的时候买入的投资，在10年后的收益率越高，当然这不是绝对的，有个别年份例外，比如1899年，市盈率高达22.9倍，但十年后收益率也有5.5%，而1922年市盈率只有7.4，但10年后也只有8.7%，这其实很好理解，周期不同，也就造成了这样的差距，比如1909年是牛市的顶点，所以1899年市盈率高也就无所谓，1931年刚好是危机的最低点，所以1922年市盈率再低也没什么卵用。但是有一点席勒教授没说，如果我们不机械的用10年时间去算，而是用最高点去算，那么肯定是市盈率越低的年份，你投入股票，未来十年内取得巨大回报的概率越大，比如1922年你买入股票，如果你1929年高点抛掉了，那么就会赚很多钱了。而不必非得机械的拿到1931年再抛。

席勒当时预测，2000年市盈率超过了40倍，那么10年后的收益率能到多少？估计是负数，那么到底是不是负数呢？我们找到道琼斯工业指数，1999年的高点不到12000点，2010年4月大概也是11200多点，所以10年投资无增长，肯定是负数。所以即使股市长期向好，经济长期向好，也不代表你随便哪一天都可以买股票。买高了一样是十年赚不到钱。



但是，有一点要注意，同样是11000多点，十年前的道琼斯就是高估，十年之后的道琼斯却是低估，所以第二句话要记住，股市投资时间是你的朋友，高估值会在时间中被逐渐融化。所以从这个意义上来说，你买指数，只做指数投资，长期持有。是不会赔钱的。你在股市中的收益是负数，那么就连买入加长期持有，这两句话都没有做到。如果能通过市盈率判断10年的高低点，也就是说10年内只允许你买卖出一次股票。那么9成的人恐怕都是可以赚到很多钱的。



2000年1月标普指数也是同样的情况，当时席勒教授还算了一下指数的股息率，当时只有1.2%，而历史平均的股息率能达到4.7%，股息率严重下降也是股市严重高估的表象。我们还是来复习一下其他的书里讲过的吧，在股市上，一个价值投资者你只有三块可以赚，第一是股息，第二是公司增长，第三估值提升。第一块大概每年的收益是3%，第二块也是7%，第三块是不确定的，有可能是正的有可能是负的，总体来说是基本正负相抵，所以你长期投资股市的收益率，大概是10%左右，如果低估时候买入，股息收益能到5%，增长还是7%，估值提升可能会有10%，所以你每年收益能超过22%，这也是我们资本市场股票型基金15年来的平均收益率。而如果你在牛市最疯狂的时候买入，估值提升可能是每年负的10%，股息率大概只有2%不到，那么你最后的结果是股息率2%+公司增长7%+负的10%，最后你是每年亏掉1%，这就是散户投资的最大误区，你们进入的时间错了，做再大的努力也没用。所以记住一句大白话，买的便宜是最大的正确，买的贵了，一切专业都是白搭。

当时之所以出现了这么大的股市泡沫，第一大因素就是因为互联网，当时全世界人民都认为发生了互联网革命，世界经济从工业时代进入了互联网时代，所有的传统经验都失效了。世界开始进入了多维格局。所以才会盲目自信，这次不一样了。那会股市甚至开始了市梦率来估算公司价值，一张PPT就可以给出上百倍的估值溢价。并没有什么人会怀疑。另外，第二个因素，当时的美国确实繁荣，几乎失去了一切对手，他可以在全世界一家独大，引领世界经济潮流，所以这让美国人相信，80年前的持久繁荣终于要回来了。所以股市牛就等于了美国牛，为国接盘也算是一种爱国思想的体现。

第三个因素是，新的公司组织结构诞生，越来越多的年轻人不希望继续这种雇佣与被雇佣关系，他们追求成为企业的所有者，大量企业进行股权改造，雇员也希望从公司的增长中得到一份利益。98年股票期权已经占到了股票发行量的6.2%，股票价格高于行权价格，就会给员工带来巨大的收益，所以管理人员有利益把它们公司的股价做高，从而套现。于是各个公司都在做市值管理。说白了就是自己坐庄或者找人帮自己坐庄，抬高自己公司的股价。

第四个因素是共和党国会及资本收益税削减，里根当总统以来，共和党控制了参众两院，所以大家觉得这是一个强有力的政府，能够控制股市的涨跌，也就是我们经常说的，国家不会让股市跌。共和党不会让股市跌。事实也确实如此，共和党确实在努力，1997年共和党把资本收益税从28%，降到了20%，这就刺激了股市大涨。当时的预期是，资本利得税会进一步削减。直到后来克林顿政府上台，才否决了这个想法。股市的预期也随即被打破。

第五，生育高峰来临，1966年以来，美国人口增长出现了减退的势头，并一直延续到今天，这主要是跟科技进步有关，经济越繁荣，生育率就越低。但在2000年前后，受到上一波的婴儿潮影响，生育率开始反弹。而生育高峰跟股市竟然还有关系，席勒教授说，在生育高峰期间，人们对于风险变得不再厌恶。他是预感到未来会越来越好才会生孩子，那么既然对未来有信心，也就更愿意增加风险投资。那时候真是一片乐观，有本书叫做21世纪的投资者，预测股市能兴旺到2009年，这本书竟然在那几年长期占据畅销书的行列。而这本书的依据就是，人口兴旺股市兴旺，到2009年，46岁年龄组的人数下降，股市才会滑坡。

* */
Page({
    data: {
        name: "test"
    }
})