/**
 * @file
 * @author: lzb
 * @params: 参数说明
 * @history:
 * Date      Version Remarks
 * ========= ======= ==================================
 * 2018/7/3      1.0     First version
 *
 */
/*
* 各位书友大家好，欢迎继续做客老齐的读书圈，今天我们继续讲这本罗伯特席勒教授的经典著作，非理性繁荣，是描绘2000年互联网泡沫的书。昨天说到了2000年非理性繁荣的因素。第六大因素就是媒体的大量报道，当时网络大量出现，这导致了新闻曝光量猛增。有些电视网甚至提供不间断的财经报道，股市的消息更是无处不在。传播的也更快。这些消息就像是一场一场的促销广告，因为股市上涨了， 所以看到股市上涨的人就更多了，因为更多的人都看到了消息，跃跃欲试，所以反过来股市就上涨的更快。

第七个因素，分析师也越来越不专业，他们变得越来越乐观。1999年6000家公司做出评级中，只有1%是卖出，70%都是买入，29%是持股。而10年前1989年，他们建议卖出的比例还有9.1%。这有机制的原因，现在A股也是如此，你很少看到卖出评级的报告，因为上市公司会拒绝配合这种负面评级报告的机构调查。以后他们可能再也拿不到一手信息了。这是投资行业的基础发生了变化。甚至有些分析师从事承销股票的工作。他们的任务就是找到理由去卖股票，然后从中分享提成。有经济学家做了判断，分析师们在18年中，16年都高估了实际增长率，平均每年高估9个点，也就是说你看到分析师的报告，减去9个百分点就更为合理，比如他预期公司将以每年30%的速度增长，那么你最好用21%来算估值。

第八个因素，规定缴费养老金方案的推广。1989年美国401k方案制定，雇员有机会获得该账户的分摊额，他们拥有401k账户上的投资，当时的税法也鼓励雇主多分担雇员的账户资金。至于投资的方向自然就是股票和债券，所以这也就强制了老百姓，都会去投一些股票。所以401k计划给股市提供着源源不断的资金。反正你的钱也拿不出来，而且也是公司替你交，理所当然也就都拿去买股票了。一般都是以股6债4的形式去配置资产。股票占据了大头。

第九个因素，共同基金的发展，1982年，美国这一轮牛市开始，当时共同基金只有340只，而到了1998年，共同基金已经达到了3513只，基金比纽交所的股票还多，而基金也早就深入了家庭，1982年每10个美国家庭有一个基金账户，而到了1998年每个家庭有2个基金账户。大家以为机构投资者都是理性的专业的，但其实他们只不过是大散户而已，他们也会去追逐热点。也会贪婪和恐惧。

第十个因素，通胀回落的货币幻觉，也就是说通胀的发生，刺激了大家对于追求回报的欲望，不跑过刘翔也得跑过CPI这是大爷大妈都知道的一句话，大家害怕通胀吃掉自己辛苦赚来的钱，所以他们才玩命的去投资。而新闻媒体报道的股价上涨，从不剔除掉通胀影响，所以总给受众以误导。其实你公布一下剔除通胀之后的股价涨幅，大家就明白了，股市已经十分高估了。其实通胀没那么可怕，通胀高企的年份只是那么几次，在中国历史上就87-88年价格闯关，93-94年一次，97年一次，但金融风暴来袭，让这次基本上没有显现，2008年一次，但也很快纠偏。之后就没发生过高通胀，通胀率基本保持平稳。但大家还是记得高通胀的惨痛教训，也学会了CPI这个名词，在低通胀时期，也神经病一样的追求高风险投资，而且大家习惯于拿房价算通胀，这是绝对错误的，房子是资产价格，你拿一个涨的最快的资产泡沫当标准，就相当于你要去跑过一个吃了兴奋剂的博尔特，结果可想而知，你不会成功的。

第十一个因素，交易频繁增加，纳斯达克电子盘的引入，让买卖股票更加容易了。1990年的时候，纳斯达克全部股票一年换手一次，而1999年一年要换手两次还要多。这种换手率的大幅提升，催生了短线交易的活跃，当然证券经纪人很乐于看到这种情况，他们可以赚到更多的佣金。投机就会让市场失去理性，交易频率的增加，就会让追涨杀跌变得更疯狂。

第十二个因素，赌博机会增加，美国在1970年以前，基本没什么赌博业，1970年之后有了赛马和赛狗，1975年13个州发行彩票，1999年，37个州提供了彩票服务，博彩业越来越流行。此外电子赌博也越来越多，1998年1.25亿美国人参与了赌博，这是全国大部分成年人口。大家对于赌博的偏爱，让他们天然的把股市看成了一个大赌场。而在历史上上赌博热总是跟股市泡沫同时出现。

这些因素都是当年造成美国股市大泡沫的原因，而他们也影响了投资者本身。比如让投资者信心爆棚。当时席勒教授做了一份调查问卷，问你认为在长远角度看，股市是最好的投资吗，结果76%的人对此深信不疑，20%的人表示很有信心。只有2%中立，另外2%不同意。96%的人看好股市，这个比例非常的高。但在非牛市的时候，教授也做过类似的问卷，那时候大家更倾向于买房和政府债券。

接下来他又做了一个调查，你认为1999年的股市安全吗？结果非常同意的占47%，有些同意的占44%，中立3%，不同意的6%。91%的人认为泡沫下的股市相当安全，这本身就说名了很大问题。

所以股市的风险绝对不是所见即所得，甚至可以说所见非所得，你认为股市风险很大的时候，比如股灾之中，其实股市的风险很小，当你认为股市没风险，邻居王二狗家的保姆都赚钱了，这时候股市的风险大到惊人。但你去问一个投资者，你是极其乐观吗？他往往不会承认，他说我很理性。只是我相信国家不会让股市跌下来，这其实已经说明他傻得厉害。这在股市上叫做一致性预期，当所有人都认为一个事情发生的时候，这个事情就要开始反转了。

很多关于投资的书都会给大家讲，比如一个年轻人一年赚3万美元，每年获得10%的股市回报，到他退休的时候，能有140万美元的身价。但同样的一篇文章，在1929年发布在媒体上，后来随着股市崩盘，这个杂志都跟着臭名远扬。所以，同样的股市，同样的内容，同样的增长获利能力，你不同位置去感受，那么结论完全不一样。老齐记得也很清楚十几年前2007年，那会大牛市，老齐正好在电视台，全台收视率最高的节目是证券分析节目，比唱歌跳舞的综艺节目还高，而3年后股市暴跌到底部，再看股市节目，收视率接近于零。其实收视率是一个很好地股市行为判断指标，证券节目火爆的时候，一般都是大牛市的顶点。

作者说，1999年7月，有份调查数据显示，投资者预期未来12个月，在股市中的平均收益率是15%，这也是一个相当乐观的数字，还有人对共同基金调查，未来十年中，他们的平均预期年回报达到了34%。这个相当不靠谱的，以至于作者认为这份调查出问题了。是不是总回报34%？其实，这些都不夸张，老齐记得当年qdii基金发行，那是在2007年大牛市的顶点来临之前，老齐举着话筒，去金融街采访排队抢购的大妈，问他您知道买到的是什么吗？基金啊，知道QDII是什么意思吗，那不知道。知道他投向哪吗？这我们小老百姓也不懂，那您预期他的收益会有多少呢？一年不用太多，50%就行。真别说，大妈说的还真是准，一年下来，那只QDII真的有50%，但不是赚了50%，而是亏了一半。所以有了这次采访经历，现在但凡是基金发行热潮，抢购新基金！老齐心里总是会咯噔一下。这很可能是市场见顶的标志之一。2018年1月份，兴全合宜基金开售，一天卖出300亿，这消息一出。我就觉得，市场该见顶了。老齐的感觉准不准呢，咱们后面可以返回来看看。

所以，老齐一直建议大家应该多到群众中去，群众是最可爱的人，多去散户大厅转转，大爷大妈们会用实际行动，诠释什么叫精确地反向指标。当老齐出去吃饭，故意提起股票，老公一个个都面如土色，媳妇们都怒目而视的时候，我就知道，股市基本到底了。相反他们开始拉着你，给老齐讲内幕消息的时候，估计市场也就蹦跶不了几天了。股市走过了上百年，唯一不变的就是7赔2平1赚，大部分赚钱了，一定是一场先色诱再强奸的过程。当股市明明高估了，还越涨越快的时候，其实就是在告诉你，现在是市场情绪决定价格，而已经不是价值。所以什么是经验，经验就是，你能看到行为背后的人心变化。明天，我们讲继续讲述公众情绪对市场的影响。咱们明天再见。
* */
const _ = require('../../libs/underscore.js')
let navInfoList = []
Page({
    data: {
        currentNav: {
            id: 1,
            parent: '全部'
        },
        navInfoList: [],
        navList: [
            {
                id: 1,
                parent: '全部'
            },
            {
                id: 2,
                parent: '蔬菜'
            },
            {
                id: 3,
                parent: '水果'
            },
            {
                id: 4,
                parent: '肉类'
            },
            {
                id: 5,
                parent: '海鲜'
            },
            {
                id: 6,
                parent: '配料'
            },
            {
                id: 7,
                parent: '蛋类'
            },
            {
                id: 8,
                parent: '鱼类'
            },
            {
                id: 9,
                parent: '水产类'
            },
            {
                id: 10,
                parent: '冻品类'
            },
            {
                id: 11,
                parent: '干货粮油'
            },
            {
                id: 12,
                parent: '熟食'
            }
        ]
    },

    onLoad: () => {
        let self = this
        let query = wx.createSelectorQuery()
        query.selectAll('.ui-item').boundingClientRect()
        query.exec(function (response) {
            navInfoList = response[0]
        })
    },
    getNav: function (e) {
        let self = this
        let currentNav = e.currentTarget.dataset.params
        let id = e.currentTarget.id

        let item = _.find(navInfoList, {id: id})
        _.extend(currentNav, item)

        self.setData({
            currentNav: currentNav
        })
    }
})

